In [1]:
# import pandas library
import pandas as pd

In [17]:
baby_names = pd.read_csv("babies-first-names.csv")

### 1. The 5 most popular baby name in 2018

In [22]:
baby_names_2018 = baby_names.loc[baby_names["yr"] == 2018, : ]
sorted_names_2018 = baby_names_2018.sort_values('number', ascending = False)
sorted_names_2018.iloc[0:5]

          yr sex FirstForename  number  rank position
228551  2018   G        Olivia     444     1        1
228552  2018   G         Emily     423     2        2
225086  2018   B          Jack     422     1        1
228553  2018   G          Isla     383     3        3
228554  2018   G        Sophie     331     4        4

### 2. The 5 most popular baby name by year and sexe

In [31]:
def popular(serie):
    """This function receives a pandas series, containing baby names in order of highest number of birth.
    It returns the most popular names in element"""
    return serie.iloc[0]

In [42]:
grouped_names = baby_names.sort_values('number', ascending = False).groupby(['yr', 'sex']).agg(popular)
grouped_names

         FirstForename  number  rank position
yr   sex
1974 B           David    1794     1        1
     G          Nicola     935     1        1
1975 B           David    1793     1        1
     G          Nicola     907     1        1
1976 B           David    1744     1        1
...                ...     ...   ...      ...
2018 G          Olivia     444     1        1
2019 B            Jack     449     1        1
     G          Olivia     394     1        1
2020 B            Jack     354     1        1
     G            Isla     347     1        1

[94 rows x 4 columns]